package Lesson_7.gb;

public class Test {
}
//        1 какой резульат?
//
//class Test123 {
//    List<Integer> list;
//
//    Test123() {
//        list = new ArrayList<>();
//        someTest(list);
//    }
//
//    void someTest(List<Integer> al) {
//        al.add(0);
//        al = null;
//    }
//
//    public static void main(String[] args) {
//        Test123 test = new Test123();
//        System.out.println(test.list.size());
//    }
//}
//












//
//2 Есть таблица employees нужно написать запрос чтобы получить все записи из
// таблицы в колонке last_name,
// значения которые начинаются с JDBC
//
//















//
//        3 Напишите 1 запрос дления сразу двух колонок в таблице employees (столбцы name, surname)ля обнов
















// 4 Являются ли массивы в java однородными














// 5

//
//class TestFive {
//    public static void main(String[] args) {
//        boolean toBe = false;
//        PrinceOfJava prince = new PrinceOfJava();
//        prince.torturePrince((toBe || !toBe));
//    }
//}
//
//class PrinceOfJava {
//    void torturePrince(boolean mind) {
//        if (mind) {
//            System.out.println("i will hate everybody");
//        } else {
//            System.out.println("i like citizen");
//        }
//    }
//}






















// 6 В каком порядке должны размещаться следующие опертаторы


// 1 вариант
// Package statement
// Imports
// Class or interface definitions


// 2 вариант
// Imports
// Package statement
// Class or interface definitions

// 3 вариант
// в любом порядке




